Revit 2027 API
ExtendedParameterElement.LinkId Property
 The ID of the [!:Autodesk::Revit::DB::ExternalData::ExtendedPropertiesLink] to which this extended property belongs.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkId { get; }
Public ReadOnly Property LinkId As ElementId
	Get
public:
property ElementId^ LinkId {
	ElementId^ get ();
}
member LinkId : ElementId with get
Property Value
ElementId
See Also
Reference
ExtendedParameterElement Class
Autodesk.Revit.DB.ExternalData Namespace